In [19]:
import pandas as pd
import numpy as np

In [12]:
df = pd.DataFrame({'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]}); df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [13]:
df[df.AAA > 5]

   AAA  BBB  CCC
2    6   30  -30
3    7   40  -50

In [16]:
df.loc[df.AAA >= 5,'BBB']

1    20
2    30
3    40
Name: BBB, dtype: int64

In [17]:
df = pd.DataFrame({'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]}); df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [20]:
df['logic'] = np.where(df['AAA'] > 5,'high','low'); df

   AAA  BBB  CCC logic
0    4   10  100   low
1    5   20   50   low
2    6   30  -30  high
3    7   40  -50  high

In [21]:
newseries = df.loc[(df['BBB'] < 25) & (df['CCC'] >= -40), 'AAA']; newseries

0    4
1    5
Name: AAA, dtype: int64

In [22]:
df = pd.DataFrame({'AAA' : [1,2,1,3], 'BBB' : [1,1,2,2], 'CCC' : [2,1,3,1]}); df

   AAA  BBB  CCC
0    1    1    2
1    2    1    1
2    1    2    3
3    3    2    1

In [23]:
source_cols = df.columns # or some subset would work too.
new_cols = [str(x) + "_cat" for x in source_cols]
categories = {1 : 'Alpha', 2 : 'Beta', 3 : 'Charlie' }
df[new_cols] = df[source_cols].applymap(categories.get);df

   AAA  BBB  CCC  AAA_cat BBB_cat  CCC_cat
0    1    1    2    Alpha   Alpha     Beta
1    2    1    1     Beta   Alpha    Alpha
2    1    2    3    Alpha    Beta  Charlie
3    3    2    1  Charlie    Beta    Alpha

In [29]:
df1 = pd.DataFrame(np.random.randn(6,4),index=list(range(0,12,2)),columns=list(range(0,8,2)))
df1

           0         2         4         6
0  -0.156223 -0.999694 -0.773546 -0.623874
2   1.809489  0.028056 -0.360387 -0.508562
4   0.135830  2.048811 -0.149822 -1.414531
6   0.911699  0.528145 -1.337806 -0.866318
8  -0.172968  0.186026 -1.119982  0.845076
10  1.454557 -1.898333  0.327342 -0.807871

In [26]:
df1.iloc[:3]

          0         2         4         6
0 -0.175467 -1.036244 -1.086188  0.846422
2  0.850159 -0.220122  0.290358 -1.493119
4 -0.531424 -0.587358  0.555532  0.407903

In [27]:
df1.iloc[[1, 3, 5], [1, 3]]

           2         6
2  -0.220122 -1.493119
6   2.194755  1.393273
10 -0.453633 -0.602189

In [30]:
df1.iloc[1]

0    1.809489
2    0.028056
4   -0.360387
6   -0.508562
Name: 2, dtype: float64